app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Software Engineering"], ["room_number", 10], ["created_at", "2019-03-21 00:23:29.526085"], ["updated_at", "2019-03-21 00:23:29.526085"]]
---
  def create
    binding.pry
    @school_class = SchoolClass.create(school_class_params(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-03-21 00:23:29.554959"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find_by_id(params[:id])
    @school_class.update(school_class_params(:title, :room_number))