app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-03-20 21:29:57.884332"], ["updated_at", "2019-03-20 21:29:57.884332"]]
---
  def create
    raise params.inspect
    @student = Student.create(student_params(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @student = Student.find_by_id(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-03-20 21:29:58.429294"], ["id", 1]]
---
  def update
    @student = Student.find_by_id(params[:id])
    @student.update(student_params(:first_name, :last_name))